dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/boards.txt
promicro_nrf52840.menu.bootloader.promicroserialnosd.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1 -DNRF_SYSTEM_RUNTIME_USB_VID=0x239A -DNRF_SYSTEM_RUNTIME_USB_PID=0x00B4 -DNRF_USBD_1200_RESET_ARM_MS=400 -DNRF_USBD_IGNORE_INITIAL_1200_RESET_COUNT=0
promicro_nrf52840.menu.bootloader.promicroserialnosd.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1 -DNRF_SYSTEM_BOOTLOADER_RESET_MODE=2
promicro_nrf52840.menu.bootloader.promicroserialnosd.build.bootloader_app_start=0x1000
promicro_nrf52840.menu.bootloader.promicroserialnosd.build.ldscript=nrf52840.ld
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.maximum_data_size=262144
promicro_nrf52840.menu.bootloader.promicroseriallegacy=Serial DFU, SoftDevice S140 v7 / legacy layout (0x27000)
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.bootloader_mode=adafruit-dfu
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.usb_vid=0x239A
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.usb_pid=0x00B3
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.uf2_app_start=0x27000
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.adafruit_sd_req=0x0123
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.uf2_volume_label=NICENANO
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.uf2_model=nice!nano
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.uf2_board_id=nRF52840-nicenano
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.maximum_size=794624
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.use_1200bps_touch=false
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.wait_for_upload_port=false
promicro_nrf52840.menu.bootloader.promicroseriallegacy.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1 -DNRF_SYSTEM_BOOTLOADER_RESET_MODE=2
promicro_nrf52840.menu.bootloader.promicroseriallegacy.build.bootloader_app_start=0x27000
promicro_nrf52840.menu.bootloader.nicenano=nice!nano v2 UF2, SoftDevice S140 v6 layout (0x26000)
promicro_nrf52840.menu.bootloader.nicenano.upload.bootloader_mode=uf2
promicro_nrf52840.menu.bootloader.nicenano.upload.usb_vid=0x239A
promicro_nrf52840.menu.bootloader.nicenano.upload.usb_pid=0x00B3
promicro_nrf52840.menu.bootloader.nicenano.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.nicenano.upload.uf2_app_start=0x26000
promicro_nrf52840.menu.bootloader.nicenano.upload.adafruit_sd_req=0x00B6
promicro_nrf52840.menu.bootloader.nicenano.upload.uf2_volume_label=NICENANO
promicro_nrf52840.menu.bootloader.nicenano.upload.uf2_model=nice!nano
promicro_nrf52840.menu.bootloader.nicenano.upload.uf2_board_id=nRF52840-nicenano
promicro_nrf52840.menu.bootloader.nicenano.upload.maximum_size=798720
promicro_nrf52840.menu.bootloader.nicenano.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
promicro_nrf52840.menu.bootloader.nicenano.build.bootloader_app_start=0x26000
promicro_nrf52840.menu.bootloader.nordicdfu=Nordic PCA10059 USB serial DFU (MBR, 0x1000)
promicro_nrf52840.menu.bootloader.nordicdfu.upload.bootloader_mode=nordic-dfu
promicro_nrf52840.menu.bootloader.nordicdfu.upload.usb_vid=0x1915
promicro_nrf52840.menu.bootloader.nordicdfu.upload.usb_pid=0x521F
promicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_family_id=
promicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_app_start=0x1000
promicro_nrf52840.menu.bootloader.nordicdfu.upload.adafruit_sd_req=0x00
promicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_volume_label=
promicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_model=
promicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_board_id=
promicro_nrf52840.menu.bootloader.nordicdfu.upload.maximum_size=897024
promicro_nrf52840.menu.bootloader.nordicdfu.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
promicro_nrf52840.menu.bootloader.nordicdfu.build.bootloader_app_start=0x1000
promicro_nrf52840.menu.bootloader.nordicdfu.build.ldscript=nrf52840.ld
promicro_nrf52840.menu.bootloader.nordicdfu.upload.maximum_data_size=262144
promicro_nrf52840.menu.bootloader.xiaouf2=Seeed XIAO UF2, SoftDevice S140 v7 layout (0x27000)
promicro_nrf52840.menu.bootloader.xiaouf2.upload.bootloader_mode=uf2
promicro_nrf52840.menu.bootloader.xiaouf2.upload.usb_vid=0x2886
promicro_nrf52840.menu.bootloader.xiaouf2.upload.usb_pid=0x0044
promicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_app_start=0x27000
promicro_nrf52840.menu.bootloader.xiaouf2.upload.adafruit_sd_req=0x0123
promicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_volume_label=XIAO-BOOT
promicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_model=Seeed XIAO nRF52840
promicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_board_id=nRF52840-SeeedXiao-v1
promicro_nrf52840.menu.bootloader.xiaouf2.upload.maximum_size=794624
promicro_nrf52840.menu.bootloader.xiaouf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
promicro_nrf52840.menu.bootloader.xiaouf2.build.bootloader_app_start=0x27000
promicro_nrf52840.menu.bootloader.makerdiaryuf2=MakerDiary nRF52840 M.2 UF2, SoftDevice S140 v6 layout (0x26000)
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.bootloader_mode=uf2
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.usb_vid=0x2886
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.usb_pid=0xF00F
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_app_start=0x26000
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.adafruit_sd_req=0x00B6
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_volume_label=nRF52840M2
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_model=MakerDiary nRF52840 M.2 Module
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_board_id=nRF52840M2
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.maximum_size=798720
promicro_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
promicro_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_app_start=0x26000
promicro_nrf52840.menu.bootloader.makerdiarynosduf2=MakerDiary nRF52840 M.2 UF2, no SoftDevice / MBR only (0x1000)
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.bootloader_mode=uf2
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.usb_vid=0x2886
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.usb_pid=0xF00F
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_app_start=0x1000
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.adafruit_sd_req=0xFFFE
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_volume_label=nRF52840M2
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_model=MakerDiary nRF52840 M.2 Module
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_board_id=nRF52840M2
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.maximum_size=950272
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
promicro_nrf52840.menu.bootloader.makerdiarynosduf2.build.bootloader_app_start=0x1000
promicro_nrf52840.menu.bootloader.makerdiaryuf2.build.ldscript=nrf52840.ld
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.maximum_data_size=262144
promicro_nrf52840.menu.buildprofile.release=Release (smaller/faster, -Os)
promicro_nrf52840.menu.buildprofile.release.compiler.optimization_flags=-Os
promicro_nrf52840.menu.buildprofile.release.build.debug_flags=
promicro_nrf52840.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
promicro_nrf52840.menu.buildprofile.debug=Debug symbols (-Og -g3)
promicro_nrf52840.menu.buildprofile.debug.compiler.optimization_flags=-Og
promicro_nrf52840.menu.buildprofile.debug.build.debug_flags=-g3 -DDEBUG
promicro_nrf52840.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
promicro_nrf52840.menu.buildprofile.usbgdbstub=Arduino IDE Debug over USB CDC (GDB stub)
promicro_nrf52840.menu.buildprofile.usbgdbstub.compiler.optimization_flags=-Og
promicro_nrf52840.menu.buildprofile.usbgdbstub.build.debug_flags=-g3
promicro_nrf52840.menu.buildprofile.usbgdbstub.build.profile_flags=-DNRF_BUILD_PROFILE=2 -DNRF_SYSTEM_USB_GDB_STUB=1
# When the USB CDC GDB stub profile is selected, route Arduino IDE 2's
# debugger to our PowerShell TCP-serial bridge instead of OpenOCD/SWD.
#
# arduino-cli's `Debug` command only accepts a built-in set of server-type
# names (openocd, jlink, stutil, pyocd, bmp); `usbgdbstub` here would be
# rejected with "GDB server 'usbgdbstub' is not supported". So we pretend
# to be openocd: keep `debug.server=openocd` (the same as other profiles)
# and override `debug.server.openocd.path` to point at our launcher EXE.
# It must be a real .exe, not a .cmd: cortex-debug spawns the server with
# Node child_process.spawn() and no shell, and modern Node throws EINVAL on
# .cmd/.bat (CVE-2024-27980), so a .cmd silently never runs (read ECONNRESET
# / "Request cancelled"). usb_gdbstub_server.exe parses the gdb_port that
# cortex-debug assigns (it owns the port; e.g. 50000) and spawns
# usb_gdbstub_bridge.ps1 on it. The bridge prints
# "Listening on port <N> for gdb connections" once its TCP socket is ready;
# that matches cortex-debug's default openocd serverReady regex, so it then
# connects GDB to localhost:<N>. One-click Debug in Arduino IDE 2 with no
# separate "start bridge" terminal.
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server=openocd
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server.openocd.path={runtime.platform.path}/tools/niusrobotlab/usb_gdbstub_server.exe
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server.openocd.path.windows={runtime.platform.path}\tools\niusrobotlab\usb_gdbstub_server.exe
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server.openocd.scripts_dir=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server.openocd.scripts_dir.windows=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server.openocd.scripts.0=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.servertype=openocd
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.gdbTarget=localhost:3335
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.gdbPort=3335
# The stub does not implement OpenOCD `monitor` extensions. Override the
# default post-attach / restart command sequence so cortex-debug doesn't fire
# them. The target is already halted at the BKPT in setup() when GDB attaches,
# so a plain `c` is enough to resume.
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.postAttachCommands.0=set remote hardware-watchpoint-limit 0
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.postAttachCommands.1=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.postAttachCommands.2=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.postAttachCommands.3=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.overrideRestartCommands.0=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.overrideRestartCommands.1=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.overrideRestartCommands.2=
promicro_nrf52840.menu.storage.log=Wear leveling (recommended)
promicro_nrf52840.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
promicro_nrf52840.menu.storage.log.build.storage_reserved_bytes=16384
promicro_nrf52840.menu.storage.legacy=Single page (legacy)
promicro_nrf52840.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=16384
promicro_nrf52840.menu.storage.legacy.build.storage_reserved_bytes=16384

