dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/boards.txt
# ----- PWM speed (default prescaler / countertop for new modules) -----------
# All four PWM modules still support per-pin nrfPwmSetPinFrequency() at run
# time; this menu just biases the BUILD-TIME default for analogWrite(pin, v)
# without any explicit frequency call. The math is freq = 16 MHz / (1<<P) /
# (top+1), so the carrier shown below is the analogWrite default.
promicro_nrf52840.menu.pwmclock.auto=Auto/default (~1 kHz)
promicro_nrf52840.menu.pwmclock.auto.build.pwm_clock_flags=
promicro_nrf52840.menu.pwmclock.high=High frequency (~16 kHz)
promicro_nrf52840.menu.pwmclock.high.build.pwm_clock_flags=-DNRF_PWM_DEFAULT_PRESCALER=0 -DNRF_PWM_DEFAULT_COUNTERTOP=999
promicro_nrf52840.menu.pwmclock.low=Low frequency (~125 Hz)
promicro_nrf52840.menu.pwmclock.low.build.pwm_clock_flags=-DNRF_PWM_DEFAULT_PRESCALER=7 -DNRF_PWM_DEFAULT_COUNTERTOP=999

nicenano_v2.name=nice!nano v2 (experimental)
nicenano_v2.upload.tool=niusdfu
nicenano_v2.upload.tool.default=niusdfu
nicenano_v2.upload.use_1200bps_touch=false
nicenano_v2.upload.wait_for_upload_port=false
nicenano_v2.upload.enter_bootloader_only=false
nicenano_v2.upload.protocol=dfu
nicenano_v2.upload.usb_vid=0x239A
nicenano_v2.upload.usb_pid=0x00B3
nicenano_v2.upload.runtime_usb_pid=0x00B4
nicenano_v2.upload.runtime_usb_vid=0x239A
nicenano_v2.upload.dfu_alt=0
nicenano_v2.upload.bootloader_mode=adafruit-dfu
nicenano_v2.upload.uf2_family_id=0xADA52840
nicenano_v2.upload.uf2_app_start=0x26000
nicenano_v2.upload.adafruit_sd_req=0x00B6
nicenano_v2.upload.uf2_volume_label=NICENANO
nicenano_v2.upload.uf2_model=nice!nano
nicenano_v2.upload.uf2_board_id=nRF52840-nicenano
nicenano_v2.bootloader.tool=niusboot
nicenano_v2.bootloader.tool.default=niusboot
nicenano_v2.bootloader.file=nice_nano/nice_nano_bootloader-0.6.0_s140_6.1.1.hex
nicenano_v2.build.openocdscript=nrf52-cmsis-dap.cfg
nicenano_v2.build.jlink_device=NRF52840_XXAA
nicenano_v2.upload.maximum_size=798720
nicenano_v2.upload.maximum_data_size=237568
nicenano_v2.upload.ram_end=0x20040000
nicenano_v2.upload.flash_end=0x00100000
nicenano_v2.build.mcu=cortex-m4
nicenano_v2.build.f_cpu=64000000L
nicenano_v2.build.board=NRF52_NICENANO_V2
nicenano_v2.build.core=arduino
nicenano_v2.build.variant=nicenano_v2
nicenano_v2.build.ldscript=nrf52840_s140_compat.ld
nicenano_v2.build.usb_product="nice!nano v2"
nicenano_v2.build.base_flags=-DARDUINO_NRF52_NICENANO_V2 -DNRF_BOARD_HAS_NATIVE_USB=1 -DNRF_BOARD_HAS_BATTERY=1 -DNRF_BOARD_BATTERY_VDDH_DIV5=1 -DNRF_BOARD_HAS_WIFI=0 -DNRF_BOARD_HAS_IMU=0 -DNRF_BOARD_HAS_NFC=1
nicenano_v2.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=0
nicenano_v2.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
nicenano_v2.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
nicenano_v2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nicenano_v2.build.bootloader_app_start=0x26000
nicenano_v2.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
nicenano_v2.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
nicenano_v2.build.debug_flags=
nicenano_v2.build.profile_flags=-DNRF_BUILD_PROFILE=0
nicenano_v2.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1 -DNRF_SYSTEM_RUNTIME_USB_VID=0x239A -DNRF_SYSTEM_RUNTIME_USB_PID=0x00B4
nicenano_v2.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
nicenano_v2.build.storage_reserved_bytes=16384
nicenano_v2.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.upload_mode_flags} {build.bootloader_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags}
nicenano_v2.menu.usbcdc.enabled=Enabled (Serial Monitor)
nicenano_v2.menu.usbcdc.enabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
nicenano_v2.menu.usbcdc.disabled=Disabled (no Serial Monitor)
nicenano_v2.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
nicenano_v2.menu.flashprofile.internal1m=Internal flash only (1 MB)
nicenano_v2.menu.flashprofile.internal1m.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
nicenano_v2.menu.ramprofile.sram256=Built-in RAM (256 KB)
nicenano_v2.menu.ramprofile.sram256.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
nicenano_v2.menu.uploadmode.usb=USB bootloader (DFU/UF2, recommended)
nicenano_v2.menu.uploadmode.usb.upload.tool=niusdfu
nicenano_v2.menu.uploadmode.usb.upload.tool.default=niusdfu
nicenano_v2.menu.uploadmode.usb.upload.protocol=dfu
nicenano_v2.menu.uploadmode.usb.upload.use_1200bps_touch=false
nicenano_v2.menu.uploadmode.usb.upload.wait_for_upload_port=false
nicenano_v2.menu.uploadmode.usb.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
nicenano_v2.menu.uploadmode.uf2boot=Enter UF2 drive only (no upload)
nicenano_v2.menu.uploadmode.uf2boot.upload.tool=niusdfu
nicenano_v2.menu.uploadmode.uf2boot.upload.tool.default=niusdfu
nicenano_v2.menu.uploadmode.uf2boot.upload.protocol=dfu
nicenano_v2.menu.uploadmode.uf2boot.upload.use_1200bps_touch=false
nicenano_v2.menu.uploadmode.uf2boot.upload.wait_for_upload_port=false
nicenano_v2.menu.uploadmode.uf2boot.upload.enter_bootloader_only=true
nicenano_v2.menu.uploadmode.uf2boot.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
nicenano_v2.menu.uploadmode.swd=SWD programmer (CMSIS-DAP)
nicenano_v2.menu.uploadmode.swd.upload.tool=niusopenocd
nicenano_v2.menu.uploadmode.swd.upload.tool.default=niusopenocd
nicenano_v2.menu.uploadmode.swd.upload.protocol=swd
nicenano_v2.menu.uploadmode.swd.upload.use_1200bps_touch=false
nicenano_v2.menu.uploadmode.swd.upload.wait_for_upload_port=false
nicenano_v2.menu.uploadmode.swd.build.openocdscript=nrf52-cmsis-dap.cfg
nicenano_v2.menu.uploadmode.swd.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
nicenano_v2.menu.uploadmode.jlink=SWD programmer (SEGGER J-Link)
nicenano_v2.menu.uploadmode.jlink.upload.tool=niusjlink
nicenano_v2.menu.uploadmode.jlink.upload.tool.default=niusjlink
nicenano_v2.menu.uploadmode.jlink.upload.protocol=swd
nicenano_v2.menu.uploadmode.jlink.upload.use_1200bps_touch=false
nicenano_v2.menu.uploadmode.jlink.upload.wait_for_upload_port=false
nicenano_v2.menu.uploadmode.jlink.build.openocdscript=nrf52-jlink.cfg
nicenano_v2.menu.uploadmode.jlink.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
nicenano_v2.menu.uploadmode.jlink.debug.server=jlink
nicenano_v2.menu.bootloader.auto=Auto-detect (recommended)
nicenano_v2.menu.bootloader.auto.upload.bootloader_mode=auto
nicenano_v2.menu.bootloader.auto.upload.usb_vid=auto
nicenano_v2.menu.bootloader.auto.upload.usb_pid=auto
nicenano_v2.menu.bootloader.auto.upload.uf2_family_id=0xADA52840
nicenano_v2.menu.bootloader.auto.upload.uf2_app_start=0x26000
nicenano_v2.menu.bootloader.auto.upload.uf2_volume_label=
nicenano_v2.menu.bootloader.auto.upload.uf2_model=
nicenano_v2.menu.bootloader.auto.upload.uf2_board_id=
nicenano_v2.menu.bootloader.auto.upload.maximum_size=798720
nicenano_v2.menu.bootloader.auto.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nicenano_v2.menu.bootloader.auto.build.bootloader_app_start=0x26000
nicenano_v2.menu.bootloader.nicenano=nice!nano v2 UF2 mass storage (0x239A:0x00B3)
nicenano_v2.menu.bootloader.nicenano.upload.bootloader_mode=uf2
nicenano_v2.menu.bootloader.nicenano.upload.usb_vid=0x239A
nicenano_v2.menu.bootloader.nicenano.upload.usb_pid=0x00B3
nicenano_v2.menu.bootloader.nicenano.upload.uf2_family_id=0xADA52840
nicenano_v2.menu.bootloader.nicenano.upload.uf2_app_start=0x26000
nicenano_v2.menu.bootloader.nicenano.upload.adafruit_sd_req=0x00B6
nicenano_v2.menu.bootloader.nicenano.upload.uf2_volume_label=NICENANO
nicenano_v2.menu.bootloader.nicenano.upload.uf2_model=nice!nano
nicenano_v2.menu.bootloader.nicenano.upload.uf2_board_id=nRF52840-nicenano
nicenano_v2.menu.bootloader.nicenano.upload.maximum_size=798720
nicenano_v2.menu.bootloader.nicenano.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nicenano_v2.menu.bootloader.nicenano.build.bootloader_app_start=0x26000
nicenano_v2.menu.bootloader.nordicdfu=Nordic PCA10059 USB serial DFU (MBR, 0x1000)
nicenano_v2.menu.bootloader.nordicdfu.upload.bootloader_mode=nordic-dfu
nicenano_v2.menu.bootloader.nordicdfu.upload.usb_vid=0x1915
nicenano_v2.menu.bootloader.nordicdfu.upload.usb_pid=0x521F
nicenano_v2.menu.bootloader.nordicdfu.upload.uf2_family_id=
nicenano_v2.menu.bootloader.nordicdfu.upload.uf2_app_start=0x1000
nicenano_v2.menu.bootloader.nordicdfu.upload.adafruit_sd_req=0x00
nicenano_v2.menu.bootloader.nordicdfu.upload.uf2_volume_label=
nicenano_v2.menu.bootloader.nordicdfu.upload.uf2_model=
nicenano_v2.menu.bootloader.nordicdfu.upload.uf2_board_id=
nicenano_v2.menu.bootloader.nordicdfu.upload.maximum_size=897024
nicenano_v2.menu.bootloader.nordicdfu.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
nicenano_v2.menu.bootloader.nordicdfu.build.bootloader_app_start=0x1000
nicenano_v2.menu.bootloader.nordicdfu.build.ldscript=nrf52840.ld
nicenano_v2.menu.bootloader.nordicdfu.upload.maximum_data_size=262144
nicenano_v2.menu.bootloader.xiaouf2=Seeed XIAO UF2 mass storage
nicenano_v2.menu.bootloader.xiaouf2.upload.bootloader_mode=uf2
nicenano_v2.menu.bootloader.xiaouf2.upload.usb_vid=0x2886
nicenano_v2.menu.bootloader.xiaouf2.upload.usb_pid=0x0044
nicenano_v2.menu.bootloader.xiaouf2.upload.uf2_family_id=0xADA52840
nicenano_v2.menu.bootloader.xiaouf2.upload.uf2_app_start=0x27000
nicenano_v2.menu.bootloader.xiaouf2.upload.adafruit_sd_req=0x0123
nicenano_v2.menu.bootloader.xiaouf2.upload.uf2_volume_label=XIAO-BOOT
nicenano_v2.menu.bootloader.xiaouf2.upload.uf2_model=Seeed XIAO nRF52840
nicenano_v2.menu.bootloader.xiaouf2.upload.uf2_board_id=nRF52840-SeeedXiao-v1
nicenano_v2.menu.bootloader.xiaouf2.upload.maximum_size=794624
nicenano_v2.menu.bootloader.xiaouf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nicenano_v2.menu.bootloader.xiaouf2.build.bootloader_app_start=0x27000
nicenano_v2.menu.bootloader.makerdiaryuf2=MakerDiary nRF52840 M.2 UF2, SoftDevice S140 v6 layout (0x26000)
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.bootloader_mode=uf2
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.usb_vid=0x2886
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.usb_pid=0xF00F
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.uf2_family_id=0xADA52840
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.uf2_app_start=0x26000
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.adafruit_sd_req=0x00B6
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.uf2_volume_label=nRF52840M2
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.uf2_model=MakerDiary nRF52840 M.2 Module
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.uf2_board_id=nRF52840M2
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.maximum_size=798720
nicenano_v2.menu.bootloader.makerdiaryuf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nicenano_v2.menu.bootloader.makerdiaryuf2.build.bootloader_app_start=0x26000
nicenano_v2.menu.bootloader.makerdiarynosduf2=MakerDiary nRF52840 M.2 UF2, no SoftDevice / MBR only (0x1000)
nicenano_v2.menu.bootloader.makerdiarynosduf2.upload.bootloader_mode=uf2
nicenano_v2.menu.bootloader.makerdiarynosduf2.upload.usb_vid=0x2886
nicenano_v2.menu.bootloader.makerdiarynosduf2.upload.usb_pid=0xF00F
nicenano_v2.menu.bootloader.makerdiarynosduf2.upload.uf2_family_id=0xADA52840
nicenano_v2.menu.bootloader.makerdiarynosduf2.upload.uf2_app_start=0x1000
nicenano_v2.menu.bootloader.makerdiarynosduf2.upload.adafruit_sd_req=0xFFFE
nicenano_v2.menu.bootloader.makerdiarynosduf2.upload.uf2_volume_label=nRF52840M2
nicenano_v2.menu.bootloader.makerdiarynosduf2.upload.uf2_model=MakerDiary nRF52840 M.2 Module
nicenano_v2.menu.bootloader.makerdiarynosduf2.upload.uf2_board_id=nRF52840M2
nicenano_v2.menu.bootloader.makerdiarynosduf2.upload.maximum_size=950272
nicenano_v2.menu.bootloader.makerdiarynosduf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nicenano_v2.menu.bootloader.makerdiarynosduf2.build.bootloader_app_start=0x1000
nicenano_v2.menu.bootloader.makerdiaryuf2.build.ldscript=nrf52840.ld
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.maximum_data_size=262144
nicenano_v2.menu.buildprofile.release=Release (smaller/faster, -Os)
nicenano_v2.menu.buildprofile.release.compiler.optimization_flags=-Os
nicenano_v2.menu.buildprofile.release.build.debug_flags=
nicenano_v2.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
nicenano_v2.menu.buildprofile.debug=Debug symbols (-Og -g3)
nicenano_v2.menu.buildprofile.debug.compiler.optimization_flags=-Og
nicenano_v2.menu.buildprofile.debug.build.debug_flags=-g3
nicenano_v2.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
nicenano_v2.menu.buildprofile.usbgdbstub=Arduino IDE Debug over USB CDC (GDB stub)
nicenano_v2.menu.buildprofile.usbgdbstub.compiler.optimization_flags=-Og
nicenano_v2.menu.buildprofile.usbgdbstub.build.debug_flags=-g3
nicenano_v2.menu.buildprofile.usbgdbstub.build.profile_flags=-DNRF_BUILD_PROFILE=2 -DNRF_SYSTEM_USB_GDB_STUB=1
nicenano_v2.menu.storage.log=Wear leveling (recommended)
nicenano_v2.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
nicenano_v2.menu.storage.log.build.storage_reserved_bytes=16384
nicenano_v2.menu.storage.legacy=Single page (legacy)
nicenano_v2.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=16384
nicenano_v2.menu.storage.legacy.build.storage_reserved_bytes=16384

