dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/boards.txt
supermini_nrf52840.name=SuperMini nRF52840 (experimental)
supermini_nrf52840.upload.tool=niusdfu
supermini_nrf52840.upload.tool.default=niusdfu
supermini_nrf52840.upload.use_1200bps_touch=false
supermini_nrf52840.upload.wait_for_upload_port=false
supermini_nrf52840.upload.enter_bootloader_only=false
supermini_nrf52840.upload.protocol=dfu
supermini_nrf52840.upload.usb_vid=0x239A
supermini_nrf52840.upload.usb_pid=0x00B3
supermini_nrf52840.upload.runtime_usb_pid=0x00B4
supermini_nrf52840.upload.runtime_usb_vid=0x239A
supermini_nrf52840.upload.dfu_alt=0
supermini_nrf52840.upload.bootloader_mode=adafruit-dfu
supermini_nrf52840.upload.uf2_family_id=0xADA52840
supermini_nrf52840.upload.uf2_app_start=0x26000
supermini_nrf52840.upload.adafruit_sd_req=0x00B6
supermini_nrf52840.upload.uf2_volume_label=NICENANO
supermini_nrf52840.upload.uf2_model=nice!nano
supermini_nrf52840.upload.uf2_board_id=nRF52840-nicenano
supermini_nrf52840.bootloader.tool=niusboot
supermini_nrf52840.bootloader.tool.default=niusboot
supermini_nrf52840.bootloader.file=nice_nano/nice_nano_bootloader-0.6.0_s140_6.1.1.hex
supermini_nrf52840.build.openocdscript=nrf52-cmsis-dap.cfg
supermini_nrf52840.build.jlink_device=NRF52840_XXAA
supermini_nrf52840.upload.maximum_size=798720
supermini_nrf52840.upload.maximum_data_size=237568
supermini_nrf52840.upload.ram_end=0x20040000
supermini_nrf52840.upload.flash_end=0x00100000
supermini_nrf52840.build.mcu=cortex-m4
supermini_nrf52840.build.f_cpu=64000000L
supermini_nrf52840.build.board=NRF52_SUPERMINI_840
supermini_nrf52840.build.core=arduino
supermini_nrf52840.build.variant=supermini_nrf52840
supermini_nrf52840.build.ldscript=nrf52840_s140_compat.ld
supermini_nrf52840.build.usb_product="SuperMini nRF52840"
supermini_nrf52840.build.base_flags=-DARDUINO_NRF52_SUPERMINI -DNRF_BOARD_HAS_NATIVE_USB=1 -DNRF_BOARD_HAS_BATTERY=1 -DNRF_BOARD_BATTERY_VDDH_DIV5=1 -DNRF_BOARD_HAS_WIFI=0 -DNRF_BOARD_HAS_IMU=0 -DNRF_BOARD_HAS_NFC=1
supermini_nrf52840.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=0
supermini_nrf52840.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
supermini_nrf52840.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
supermini_nrf52840.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
supermini_nrf52840.build.bootloader_app_start=0x26000
supermini_nrf52840.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
supermini_nrf52840.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
supermini_nrf52840.build.debug_flags=
supermini_nrf52840.build.profile_flags=-DNRF_BUILD_PROFILE=0
supermini_nrf52840.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1 -DNRF_SYSTEM_RUNTIME_USB_VID=0x239A -DNRF_SYSTEM_RUNTIME_USB_PID=0x00B4
supermini_nrf52840.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
supermini_nrf52840.build.storage_reserved_bytes=16384
supermini_nrf52840.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.upload_mode_flags} {build.bootloader_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags}
supermini_nrf52840.menu.usbcdc.enabled=Enabled (Serial Monitor)
supermini_nrf52840.menu.usbcdc.enabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
supermini_nrf52840.menu.usbcdc.disabled=Disabled (no Serial Monitor)
supermini_nrf52840.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
supermini_nrf52840.menu.flashprofile.internal1m=Internal flash only (1 MB)
supermini_nrf52840.menu.flashprofile.internal1m.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
supermini_nrf52840.menu.ramprofile.sram256=Built-in RAM (256 KB)
supermini_nrf52840.menu.ramprofile.sram256.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
supermini_nrf52840.menu.uploadmode.usb=USB bootloader (DFU/UF2, recommended)
supermini_nrf52840.menu.uploadmode.usb.upload.tool=niusdfu
supermini_nrf52840.menu.uploadmode.usb.upload.tool.default=niusdfu
supermini_nrf52840.menu.uploadmode.usb.upload.protocol=dfu
supermini_nrf52840.menu.uploadmode.usb.upload.use_1200bps_touch=false
supermini_nrf52840.menu.uploadmode.usb.upload.wait_for_upload_port=false
supermini_nrf52840.menu.uploadmode.usb.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
supermini_nrf52840.menu.uploadmode.uf2boot=Enter UF2 drive only (no upload)
supermini_nrf52840.menu.uploadmode.uf2boot.upload.tool=niusdfu
supermini_nrf52840.menu.uploadmode.uf2boot.upload.tool.default=niusdfu
supermini_nrf52840.menu.uploadmode.uf2boot.upload.protocol=dfu
supermini_nrf52840.menu.uploadmode.uf2boot.upload.use_1200bps_touch=false
supermini_nrf52840.menu.uploadmode.uf2boot.upload.wait_for_upload_port=false
supermini_nrf52840.menu.uploadmode.uf2boot.upload.enter_bootloader_only=true
supermini_nrf52840.menu.uploadmode.uf2boot.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
supermini_nrf52840.menu.uploadmode.swd=SWD programmer (CMSIS-DAP)
supermini_nrf52840.menu.uploadmode.swd.upload.tool=niusopenocd
supermini_nrf52840.menu.uploadmode.swd.upload.tool.default=niusopenocd
supermini_nrf52840.menu.uploadmode.swd.upload.protocol=swd
supermini_nrf52840.menu.uploadmode.swd.upload.use_1200bps_touch=false
supermini_nrf52840.menu.uploadmode.swd.upload.wait_for_upload_port=false
supermini_nrf52840.menu.uploadmode.swd.build.openocdscript=nrf52-cmsis-dap.cfg
supermini_nrf52840.menu.uploadmode.swd.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
supermini_nrf52840.menu.uploadmode.jlink=SWD programmer (SEGGER J-Link)
supermini_nrf52840.menu.uploadmode.jlink.upload.tool=niusjlink
supermini_nrf52840.menu.uploadmode.jlink.upload.tool.default=niusjlink
supermini_nrf52840.menu.uploadmode.jlink.upload.protocol=swd
supermini_nrf52840.menu.uploadmode.jlink.upload.use_1200bps_touch=false
supermini_nrf52840.menu.uploadmode.jlink.upload.wait_for_upload_port=false
supermini_nrf52840.menu.uploadmode.jlink.build.openocdscript=nrf52-jlink.cfg
supermini_nrf52840.menu.uploadmode.jlink.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
supermini_nrf52840.menu.uploadmode.jlink.debug.server=jlink
supermini_nrf52840.menu.bootloader.auto=Auto-detect (recommended)
supermini_nrf52840.menu.bootloader.auto.upload.bootloader_mode=auto
supermini_nrf52840.menu.bootloader.auto.upload.usb_vid=auto
supermini_nrf52840.menu.bootloader.auto.upload.usb_pid=auto
supermini_nrf52840.menu.bootloader.auto.upload.uf2_family_id=0xADA52840
supermini_nrf52840.menu.bootloader.auto.upload.uf2_app_start=0x26000
supermini_nrf52840.menu.bootloader.auto.upload.uf2_volume_label=
supermini_nrf52840.menu.bootloader.auto.upload.uf2_model=
supermini_nrf52840.menu.bootloader.auto.upload.uf2_board_id=
supermini_nrf52840.menu.bootloader.auto.upload.maximum_size=798720
supermini_nrf52840.menu.bootloader.auto.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
supermini_nrf52840.menu.bootloader.auto.build.bootloader_app_start=0x26000
supermini_nrf52840.menu.bootloader.nicenano=nice!nano v2 UF2 mass storage (0x239A:0x00B3)
supermini_nrf52840.menu.bootloader.nicenano.upload.bootloader_mode=uf2
supermini_nrf52840.menu.bootloader.nicenano.upload.usb_vid=0x239A
supermini_nrf52840.menu.bootloader.nicenano.upload.usb_pid=0x00B3
supermini_nrf52840.menu.bootloader.nicenano.upload.uf2_family_id=0xADA52840
supermini_nrf52840.menu.bootloader.nicenano.upload.uf2_app_start=0x26000
supermini_nrf52840.menu.bootloader.nicenano.upload.adafruit_sd_req=0x00B6
supermini_nrf52840.menu.bootloader.nicenano.upload.uf2_volume_label=NICENANO
supermini_nrf52840.menu.bootloader.nicenano.upload.uf2_model=nice!nano
supermini_nrf52840.menu.bootloader.nicenano.upload.uf2_board_id=nRF52840-nicenano
supermini_nrf52840.menu.bootloader.nicenano.upload.maximum_size=798720
supermini_nrf52840.menu.bootloader.nicenano.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
supermini_nrf52840.menu.bootloader.nicenano.build.bootloader_app_start=0x26000
supermini_nrf52840.menu.bootloader.nordicdfu=Nordic PCA10059 USB serial DFU (MBR, 0x1000)
supermini_nrf52840.menu.bootloader.nordicdfu.upload.bootloader_mode=nordic-dfu
supermini_nrf52840.menu.bootloader.nordicdfu.upload.usb_vid=0x1915
supermini_nrf52840.menu.bootloader.nordicdfu.upload.usb_pid=0x521F
supermini_nrf52840.menu.bootloader.nordicdfu.upload.uf2_family_id=
supermini_nrf52840.menu.bootloader.nordicdfu.upload.uf2_app_start=0x1000
supermini_nrf52840.menu.bootloader.nordicdfu.upload.adafruit_sd_req=0x00
supermini_nrf52840.menu.bootloader.nordicdfu.upload.uf2_volume_label=
supermini_nrf52840.menu.bootloader.nordicdfu.upload.uf2_model=
supermini_nrf52840.menu.bootloader.nordicdfu.upload.uf2_board_id=
supermini_nrf52840.menu.bootloader.nordicdfu.upload.maximum_size=897024
supermini_nrf52840.menu.bootloader.nordicdfu.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
supermini_nrf52840.menu.bootloader.nordicdfu.build.bootloader_app_start=0x1000
supermini_nrf52840.menu.bootloader.nordicdfu.build.ldscript=nrf52840.ld
supermini_nrf52840.menu.bootloader.nordicdfu.upload.maximum_data_size=262144
supermini_nrf52840.menu.bootloader.xiaouf2=Seeed XIAO UF2 mass storage
supermini_nrf52840.menu.bootloader.xiaouf2.upload.bootloader_mode=uf2
supermini_nrf52840.menu.bootloader.xiaouf2.upload.usb_vid=0x2886
supermini_nrf52840.menu.bootloader.xiaouf2.upload.usb_pid=0x0044
supermini_nrf52840.menu.bootloader.xiaouf2.upload.uf2_family_id=0xADA52840
supermini_nrf52840.menu.bootloader.xiaouf2.upload.uf2_app_start=0x27000
supermini_nrf52840.menu.bootloader.xiaouf2.upload.adafruit_sd_req=0x0123
supermini_nrf52840.menu.bootloader.xiaouf2.upload.uf2_volume_label=XIAO-BOOT
supermini_nrf52840.menu.bootloader.xiaouf2.upload.uf2_model=Seeed XIAO nRF52840
supermini_nrf52840.menu.bootloader.xiaouf2.upload.uf2_board_id=nRF52840-SeeedXiao-v1
supermini_nrf52840.menu.bootloader.xiaouf2.upload.maximum_size=794624
supermini_nrf52840.menu.bootloader.xiaouf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
supermini_nrf52840.menu.bootloader.xiaouf2.build.bootloader_app_start=0x27000
supermini_nrf52840.menu.bootloader.makerdiaryuf2=MakerDiary nRF52840 M.2 UF2, SoftDevice S140 v6 layout (0x26000)
supermini_nrf52840.menu.bootloader.makerdiaryuf2.upload.bootloader_mode=uf2
supermini_nrf52840.menu.bootloader.makerdiaryuf2.upload.usb_vid=0x2886
supermini_nrf52840.menu.bootloader.makerdiaryuf2.upload.usb_pid=0xF00F
supermini_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_family_id=0xADA52840
supermini_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_app_start=0x26000
supermini_nrf52840.menu.bootloader.makerdiaryuf2.upload.adafruit_sd_req=0x00B6
supermini_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_volume_label=nRF52840M2
supermini_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_model=MakerDiary nRF52840 M.2 Module
supermini_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_board_id=nRF52840M2
supermini_nrf52840.menu.bootloader.makerdiaryuf2.upload.maximum_size=798720
supermini_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
supermini_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_app_start=0x26000
supermini_nrf52840.menu.bootloader.makerdiarynosduf2=MakerDiary nRF52840 M.2 UF2, no SoftDevice / MBR only (0x1000)
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.upload.bootloader_mode=uf2
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.upload.usb_vid=0x2886
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.upload.usb_pid=0xF00F
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_family_id=0xADA52840
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_app_start=0x1000
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.upload.adafruit_sd_req=0xFFFE
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_volume_label=nRF52840M2
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_model=MakerDiary nRF52840 M.2 Module
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_board_id=nRF52840M2
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.upload.maximum_size=950272
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
supermini_nrf52840.menu.bootloader.makerdiarynosduf2.build.bootloader_app_start=0x1000
supermini_nrf52840.menu.bootloader.makerdiaryuf2.build.ldscript=nrf52840.ld
supermini_nrf52840.menu.bootloader.makerdiaryuf2.upload.maximum_data_size=262144
supermini_nrf52840.menu.buildprofile.release=Release (smaller/faster, -Os)
supermini_nrf52840.menu.buildprofile.release.compiler.optimization_flags=-Os
supermini_nrf52840.menu.buildprofile.release.build.debug_flags=
supermini_nrf52840.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
supermini_nrf52840.menu.buildprofile.debug=Debug symbols (-Og -g3)
supermini_nrf52840.menu.buildprofile.debug.compiler.optimization_flags=-Og
supermini_nrf52840.menu.buildprofile.debug.build.debug_flags=-g3
supermini_nrf52840.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
supermini_nrf52840.menu.buildprofile.usbgdbstub=Arduino IDE Debug over USB CDC (GDB stub)
supermini_nrf52840.menu.buildprofile.usbgdbstub.compiler.optimization_flags=-Og
supermini_nrf52840.menu.buildprofile.usbgdbstub.build.debug_flags=-g3
supermini_nrf52840.menu.buildprofile.usbgdbstub.build.profile_flags=-DNRF_BUILD_PROFILE=2 -DNRF_SYSTEM_USB_GDB_STUB=1
supermini_nrf52840.menu.storage.log=Wear leveling (recommended)
supermini_nrf52840.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
supermini_nrf52840.menu.storage.log.build.storage_reserved_bytes=16384
supermini_nrf52840.menu.storage.legacy=Single page (legacy)
supermini_nrf52840.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=16384
supermini_nrf52840.menu.storage.legacy.build.storage_reserved_bytes=16384

