dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/boards.txt
nrfmicro_nrf52840.name=nRFMicro nRF52840 (experimental)
nrfmicro_nrf52840.upload.tool=niusdfu
nrfmicro_nrf52840.upload.tool.default=niusdfu
nrfmicro_nrf52840.upload.use_1200bps_touch=false
nrfmicro_nrf52840.upload.wait_for_upload_port=false
nrfmicro_nrf52840.upload.enter_bootloader_only=false
nrfmicro_nrf52840.upload.protocol=dfu
nrfmicro_nrf52840.upload.usb_vid=0x1209
nrfmicro_nrf52840.upload.usb_pid=0x5284
nrfmicro_nrf52840.upload.runtime_usb_pid=0x5284
nrfmicro_nrf52840.upload.runtime_usb_vid=0x1209
nrfmicro_nrf52840.upload.dfu_alt=0
nrfmicro_nrf52840.upload.bootloader_mode=adafruit-dfu
nrfmicro_nrf52840.upload.uf2_family_id=0xADA52840
nrfmicro_nrf52840.upload.uf2_app_start=0x27000
nrfmicro_nrf52840.upload.adafruit_sd_req=0x0123
nrfmicro_nrf52840.upload.uf2_volume_label=NRFMICRO
nrfmicro_nrf52840.upload.uf2_model=nRFMicro
nrfmicro_nrf52840.upload.uf2_board_id=nRF52840-nRFMicro-v0
nrfmicro_nrf52840.build.openocdscript=nrf52-cmsis-dap.cfg
nrfmicro_nrf52840.build.jlink_device=NRF52840_XXAA
nrfmicro_nrf52840.upload.maximum_size=794624
nrfmicro_nrf52840.upload.maximum_data_size=262144
nrfmicro_nrf52840.upload.ram_end=0x20040000
nrfmicro_nrf52840.upload.flash_end=0x00100000
nrfmicro_nrf52840.build.mcu=cortex-m4
nrfmicro_nrf52840.build.f_cpu=64000000L
nrfmicro_nrf52840.build.board=NRF52_NRFMICRO_840
nrfmicro_nrf52840.build.core=arduino
nrfmicro_nrf52840.build.variant=nrfmicro_nrf52840
nrfmicro_nrf52840.build.ldscript=nrf52840.ld
nrfmicro_nrf52840.build.usb_product="nRFMicro nRF52840"
nrfmicro_nrf52840.build.base_flags=-DARDUINO_NRF52_NRFMICRO -DNRF_BOARD_HAS_NATIVE_USB=1 -DNRF_BOARD_HAS_BATTERY=1 -DNRF_BOARD_HAS_WIFI=0 -DNRF_BOARD_HAS_IMU=0 -DNRF_BOARD_HAS_NFC=1
nrfmicro_nrf52840.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=0
nrfmicro_nrf52840.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
nrfmicro_nrf52840.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
nrfmicro_nrf52840.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1 -DNRF_SYSTEM_BOOTLOADER_RESET_MODE=1
nrfmicro_nrf52840.build.bootloader_app_start=0x27000
nrfmicro_nrf52840.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
nrfmicro_nrf52840.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
nrfmicro_nrf52840.build.debug_flags=
nrfmicro_nrf52840.build.profile_flags=-DNRF_BUILD_PROFILE=0
nrfmicro_nrf52840.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1 -DNRF_SYSTEM_RUNTIME_USB_VID=0x1209 -DNRF_SYSTEM_RUNTIME_USB_PID=0x5284
nrfmicro_nrf52840.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
nrfmicro_nrf52840.build.storage_reserved_bytes=16384
nrfmicro_nrf52840.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.upload_mode_flags} {build.bootloader_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags}
nrfmicro_nrf52840.menu.usbcdc.enabled=Enabled (Serial Monitor)
nrfmicro_nrf52840.menu.usbcdc.enabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
nrfmicro_nrf52840.menu.usbcdc.disabled=Disabled (no Serial Monitor)
nrfmicro_nrf52840.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
nrfmicro_nrf52840.menu.flashprofile.internal1m=Internal flash only (1 MB)
nrfmicro_nrf52840.menu.flashprofile.internal1m.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
nrfmicro_nrf52840.menu.ramprofile.sram256=Built-in RAM (256 KB)
nrfmicro_nrf52840.menu.ramprofile.sram256.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
nrfmicro_nrf52840.menu.uploadmode.usb=USB bootloader (DFU/UF2, recommended)
nrfmicro_nrf52840.menu.uploadmode.usb.upload.tool=niusdfu
nrfmicro_nrf52840.menu.uploadmode.usb.upload.tool.default=niusdfu
nrfmicro_nrf52840.menu.uploadmode.usb.upload.protocol=dfu
nrfmicro_nrf52840.menu.uploadmode.usb.upload.use_1200bps_touch=false
nrfmicro_nrf52840.menu.uploadmode.usb.upload.wait_for_upload_port=false
nrfmicro_nrf52840.menu.uploadmode.usb.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
nrfmicro_nrf52840.menu.uploadmode.uf2boot=Enter UF2 drive only (no upload)
nrfmicro_nrf52840.menu.uploadmode.uf2boot.upload.tool=niusdfu
nrfmicro_nrf52840.menu.uploadmode.uf2boot.upload.tool.default=niusdfu
nrfmicro_nrf52840.menu.uploadmode.uf2boot.upload.protocol=dfu
nrfmicro_nrf52840.menu.uploadmode.uf2boot.upload.use_1200bps_touch=false
nrfmicro_nrf52840.menu.uploadmode.uf2boot.upload.wait_for_upload_port=false
nrfmicro_nrf52840.menu.uploadmode.uf2boot.upload.enter_bootloader_only=true
nrfmicro_nrf52840.menu.uploadmode.uf2boot.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
nrfmicro_nrf52840.menu.uploadmode.swd=SWD programmer (CMSIS-DAP)
nrfmicro_nrf52840.menu.uploadmode.swd.upload.tool=niusopenocd
nrfmicro_nrf52840.menu.uploadmode.swd.upload.tool.default=niusopenocd
nrfmicro_nrf52840.menu.uploadmode.swd.upload.protocol=swd
nrfmicro_nrf52840.menu.uploadmode.swd.upload.use_1200bps_touch=false
nrfmicro_nrf52840.menu.uploadmode.swd.upload.wait_for_upload_port=false
nrfmicro_nrf52840.menu.uploadmode.swd.build.openocdscript=nrf52-cmsis-dap.cfg
nrfmicro_nrf52840.menu.uploadmode.swd.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
nrfmicro_nrf52840.menu.uploadmode.jlink=SWD programmer (SEGGER J-Link)
nrfmicro_nrf52840.menu.uploadmode.jlink.upload.tool=niusjlink
nrfmicro_nrf52840.menu.uploadmode.jlink.upload.tool.default=niusjlink
nrfmicro_nrf52840.menu.uploadmode.jlink.upload.protocol=swd
nrfmicro_nrf52840.menu.uploadmode.jlink.upload.use_1200bps_touch=false
nrfmicro_nrf52840.menu.uploadmode.jlink.upload.wait_for_upload_port=false
nrfmicro_nrf52840.menu.uploadmode.jlink.build.openocdscript=nrf52-jlink.cfg
nrfmicro_nrf52840.menu.uploadmode.jlink.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
nrfmicro_nrf52840.menu.uploadmode.jlink.debug.server=jlink
nrfmicro_nrf52840.menu.bootloader.auto=Auto-detect (recommended)
nrfmicro_nrf52840.menu.bootloader.auto.upload.bootloader_mode=auto
nrfmicro_nrf52840.menu.bootloader.auto.upload.usb_vid=auto
nrfmicro_nrf52840.menu.bootloader.auto.upload.usb_pid=auto
nrfmicro_nrf52840.menu.bootloader.auto.upload.uf2_family_id=
nrfmicro_nrf52840.menu.bootloader.auto.upload.uf2_app_start=0x27000
nrfmicro_nrf52840.menu.bootloader.auto.upload.uf2_volume_label=
nrfmicro_nrf52840.menu.bootloader.auto.upload.uf2_model=
nrfmicro_nrf52840.menu.bootloader.auto.upload.uf2_board_id=
nrfmicro_nrf52840.menu.bootloader.auto.upload.maximum_size=794624
nrfmicro_nrf52840.menu.bootloader.auto.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1 -DNRF_SYSTEM_BOOTLOADER_RESET_MODE=1
nrfmicro_nrf52840.menu.bootloader.auto.build.bootloader_app_start=0x27000
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy=nRFMicro legacy UF2, SoftDevice S140 v6 layout (0x26000)
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.upload.bootloader_mode=uf2
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.upload.usb_vid=0x1209
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.upload.usb_pid=0x5284
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.upload.uf2_family_id=0xADA52840
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.upload.uf2_app_start=0x26000
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.upload.adafruit_sd_req=0x00B6
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.upload.uf2_volume_label=NRFMICRO
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.upload.uf2_model=nRFMicro
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.upload.uf2_board_id=nRF52840-nRFMicro-v0
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.upload.maximum_size=798720
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nrfmicro_nrf52840.menu.bootloader.nrfmicrolegacy.build.bootloader_app_start=0x26000
nrfmicro_nrf52840.menu.bootloader.nordicdfu=Nordic PCA10059 USB serial DFU (MBR, 0x1000)
nrfmicro_nrf52840.menu.bootloader.nordicdfu.upload.bootloader_mode=nordic-dfu
nrfmicro_nrf52840.menu.bootloader.nordicdfu.upload.usb_vid=0x1915
nrfmicro_nrf52840.menu.bootloader.nordicdfu.upload.usb_pid=0x521F
nrfmicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_family_id=
nrfmicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_app_start=0x1000
nrfmicro_nrf52840.menu.bootloader.nordicdfu.upload.adafruit_sd_req=0x00
nrfmicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_volume_label=
nrfmicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_model=
nrfmicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_board_id=
nrfmicro_nrf52840.menu.bootloader.nordicdfu.upload.maximum_size=897024
nrfmicro_nrf52840.menu.bootloader.nordicdfu.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
nrfmicro_nrf52840.menu.bootloader.nordicdfu.build.bootloader_app_start=0x1000
nrfmicro_nrf52840.menu.bootloader.nicenano=nice!nano v2 UF2 mass storage
nrfmicro_nrf52840.menu.bootloader.nicenano.upload.bootloader_mode=uf2
nrfmicro_nrf52840.menu.bootloader.nicenano.upload.usb_vid=0x239A
nrfmicro_nrf52840.menu.bootloader.nicenano.upload.usb_pid=0x00B3
nrfmicro_nrf52840.menu.bootloader.nicenano.upload.uf2_family_id=0xADA52840
nrfmicro_nrf52840.menu.bootloader.nicenano.upload.uf2_app_start=0x26000
nrfmicro_nrf52840.menu.bootloader.nicenano.upload.adafruit_sd_req=0x00B6
nrfmicro_nrf52840.menu.bootloader.nicenano.upload.uf2_volume_label=NICENANO
nrfmicro_nrf52840.menu.bootloader.nicenano.upload.uf2_model=nice!nano
nrfmicro_nrf52840.menu.bootloader.nicenano.upload.uf2_board_id=nRF52840-nicenano
nrfmicro_nrf52840.menu.bootloader.nicenano.upload.maximum_size=798720
nrfmicro_nrf52840.menu.bootloader.nicenano.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nrfmicro_nrf52840.menu.bootloader.nicenano.build.bootloader_app_start=0x26000
nrfmicro_nrf52840.menu.bootloader.xiaouf2=Seeed XIAO UF2 mass storage
nrfmicro_nrf52840.menu.bootloader.xiaouf2.upload.bootloader_mode=uf2
nrfmicro_nrf52840.menu.bootloader.xiaouf2.upload.usb_vid=0x2886
nrfmicro_nrf52840.menu.bootloader.xiaouf2.upload.usb_pid=0x0044
nrfmicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_family_id=0xADA52840
nrfmicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_app_start=0x27000
nrfmicro_nrf52840.menu.bootloader.xiaouf2.upload.adafruit_sd_req=0x0123
nrfmicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_volume_label=XIAO-BOOT
nrfmicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_model=Seeed XIAO nRF52840
nrfmicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_board_id=nRF52840-SeeedXiao-v1
nrfmicro_nrf52840.menu.bootloader.xiaouf2.upload.maximum_size=794624
nrfmicro_nrf52840.menu.bootloader.xiaouf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nrfmicro_nrf52840.menu.bootloader.xiaouf2.build.bootloader_app_start=0x27000
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2=MakerDiary nRF52840 M.2 UF2, SoftDevice S140 v6 layout (0x26000)
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.bootloader_mode=uf2
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.usb_vid=0x2886
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.usb_pid=0xF00F
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_family_id=0xADA52840
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_app_start=0x26000
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.adafruit_sd_req=0x00B6
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_volume_label=nRF52840M2
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_model=MakerDiary nRF52840 M.2 Module
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_board_id=nRF52840M2
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.maximum_size=798720
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nrfmicro_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_app_start=0x26000
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2=MakerDiary nRF52840 M.2 UF2, no SoftDevice / MBR only (0x1000)
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.bootloader_mode=uf2
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.usb_vid=0x2886
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.usb_pid=0xF00F
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_family_id=0xADA52840
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_app_start=0x1000
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.adafruit_sd_req=0xFFFE
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_volume_label=nRF52840M2
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_model=MakerDiary nRF52840 M.2 Module
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_board_id=nRF52840M2
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.upload.maximum_size=950272
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nrfmicro_nrf52840.menu.bootloader.makerdiarynosduf2.build.bootloader_app_start=0x1000
nrfmicro_nrf52840.menu.buildprofile.release=Release (smaller/faster, -Os)
nrfmicro_nrf52840.menu.buildprofile.release.compiler.optimization_flags=-Os
nrfmicro_nrf52840.menu.buildprofile.release.build.debug_flags=
nrfmicro_nrf52840.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
nrfmicro_nrf52840.menu.buildprofile.debug=Debug symbols (-Og -g3)
nrfmicro_nrf52840.menu.buildprofile.debug.compiler.optimization_flags=-Og
nrfmicro_nrf52840.menu.buildprofile.debug.build.debug_flags=-g3
nrfmicro_nrf52840.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
nrfmicro_nrf52840.menu.buildprofile.usbgdbstub=Arduino IDE Debug over USB CDC (GDB stub)
nrfmicro_nrf52840.menu.buildprofile.usbgdbstub.compiler.optimization_flags=-Og
nrfmicro_nrf52840.menu.buildprofile.usbgdbstub.build.debug_flags=-g3
nrfmicro_nrf52840.menu.buildprofile.usbgdbstub.build.profile_flags=-DNRF_BUILD_PROFILE=2 -DNRF_SYSTEM_USB_GDB_STUB=1
nrfmicro_nrf52840.menu.storage.log=Wear leveling (recommended)
nrfmicro_nrf52840.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
nrfmicro_nrf52840.menu.storage.log.build.storage_reserved_bytes=16384
nrfmicro_nrf52840.menu.storage.legacy=Single page (legacy)
nrfmicro_nrf52840.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=16384
nrfmicro_nrf52840.menu.storage.legacy.build.storage_reserved_bytes=16384

