dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/boards.txt
devboard_nrf52833.name=Generic nRF52833 Development Board
devboard_nrf52833.upload.tool=niusopenocd
devboard_nrf52833.upload.tool.default=niusopenocd
devboard_nrf52833.build.openocdscript=nrf52-cmsis-dap.cfg
devboard_nrf52833.build.jlink_device=NRF52833_XXAA
devboard_nrf52833.upload.maximum_size=516096
devboard_nrf52833.upload.maximum_data_size=131072
devboard_nrf52833.upload.ram_end=0x20020000
devboard_nrf52833.upload.flash_end=0x00080000
devboard_nrf52833.build.mcu=cortex-m4
devboard_nrf52833.build.f_cpu=64000000L
devboard_nrf52833.build.board=NRF52_DEV_833
devboard_nrf52833.build.core=arduino
devboard_nrf52833.build.variant=devboard_nrf52833
devboard_nrf52833.build.ldscript=nrf52833.ld
devboard_nrf52833.build.usb_product="nRF52833 Development Board"
devboard_nrf52833.build.base_flags=-DARDUINO_NRF52_DEVBOARD_833 -DNRF_BOARD_HAS_NATIVE_USB=0 -DNRF_BOARD_HAS_BATTERY=0 -DNRF_BOARD_HAS_WIFI=0 -DNRF_BOARD_HAS_IMU=0 -DNRF_BOARD_HAS_NFC=1
devboard_nrf52833.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=0
devboard_nrf52833.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
devboard_nrf52833.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
devboard_nrf52833.build.bootloader_app_start=0x0
devboard_nrf52833.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=1 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
devboard_nrf52833.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=1 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
devboard_nrf52833.build.debug_flags=
devboard_nrf52833.build.profile_flags=-DNRF_BUILD_PROFILE=0
devboard_nrf52833.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=0
devboard_nrf52833.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=8192
devboard_nrf52833.build.storage_reserved_bytes=8192
devboard_nrf52833.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.upload_mode_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags}
devboard_nrf52833.menu.uploadmode.swd=SWD programmer (CMSIS-DAP)
devboard_nrf52833.menu.uploadmode.swd.upload.tool=niusopenocd
devboard_nrf52833.menu.uploadmode.swd.upload.tool.default=niusopenocd
devboard_nrf52833.menu.uploadmode.swd.upload.protocol=swd
devboard_nrf52833.menu.uploadmode.swd.upload.use_1200bps_touch=false
devboard_nrf52833.menu.uploadmode.swd.upload.wait_for_upload_port=false
devboard_nrf52833.menu.uploadmode.swd.build.openocdscript=nrf52-cmsis-dap.cfg
devboard_nrf52833.menu.uploadmode.swd.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
devboard_nrf52833.menu.uploadmode.jlink=SWD programmer (SEGGER J-Link)
devboard_nrf52833.menu.uploadmode.jlink.upload.tool=niusjlink
devboard_nrf52833.menu.uploadmode.jlink.upload.tool.default=niusjlink
devboard_nrf52833.menu.uploadmode.jlink.upload.protocol=swd
devboard_nrf52833.menu.uploadmode.jlink.upload.use_1200bps_touch=false
devboard_nrf52833.menu.uploadmode.jlink.upload.wait_for_upload_port=false
devboard_nrf52833.menu.uploadmode.jlink.build.openocdscript=nrf52-jlink.cfg
devboard_nrf52833.menu.uploadmode.jlink.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
devboard_nrf52833.menu.uploadmode.jlink.debug.server=jlink
devboard_nrf52833.menu.usbcdc.disabled=Unavailable (no native USB)
devboard_nrf52833.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
devboard_nrf52833.menu.flashprofile.internal512k=Internal flash only (512 KB)
devboard_nrf52833.menu.flashprofile.internal512k.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=1 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
devboard_nrf52833.menu.ramprofile.sram128=Built-in RAM (128 KB)
devboard_nrf52833.menu.ramprofile.sram128.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=1 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
devboard_nrf52833.menu.buildprofile.release=Release (smaller/faster, -Os)
devboard_nrf52833.menu.buildprofile.release.compiler.optimization_flags=-Os
devboard_nrf52833.menu.buildprofile.release.build.debug_flags=
devboard_nrf52833.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
devboard_nrf52833.menu.buildprofile.debug=Debug symbols (-Og -g3)
devboard_nrf52833.menu.buildprofile.debug.compiler.optimization_flags=-Og
devboard_nrf52833.menu.buildprofile.debug.build.debug_flags=-g3
devboard_nrf52833.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
devboard_nrf52833.menu.storage.log=Wear leveling (recommended)
devboard_nrf52833.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=8192
devboard_nrf52833.menu.storage.log.build.storage_reserved_bytes=8192
devboard_nrf52833.menu.storage.legacy=Single page (legacy)
devboard_nrf52833.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=8192
devboard_nrf52833.menu.storage.legacy.build.storage_reserved_bytes=8192

pitaya_go_nrf52840.name=Pitaya Go nRF52840 (experimental - pinout unverified)
pitaya_go_nrf52840.upload.tool=niusdfu
pitaya_go_nrf52840.upload.tool.default=niusdfu
pitaya_go_nrf52840.upload.use_1200bps_touch=false
pitaya_go_nrf52840.upload.wait_for_upload_port=false
pitaya_go_nrf52840.upload.enter_bootloader_only=false
pitaya_go_nrf52840.upload.protocol=dfu
pitaya_go_nrf52840.upload.usb_vid=0x2886
pitaya_go_nrf52840.upload.usb_pid=0xF00E
pitaya_go_nrf52840.upload.runtime_usb_pid=0xF00E
pitaya_go_nrf52840.upload.runtime_usb_vid=0x2886
pitaya_go_nrf52840.upload.dfu_alt=0
pitaya_go_nrf52840.upload.bootloader_mode=adafruit-dfu
pitaya_go_nrf52840.upload.uf2_family_id=0xADA52840
pitaya_go_nrf52840.upload.uf2_app_start=0x26000
pitaya_go_nrf52840.upload.adafruit_sd_req=0x00B6
pitaya_go_nrf52840.upload.uf2_volume_label=PITAYAGO
pitaya_go_nrf52840.upload.uf2_model=Makerdiary Pitaya Go
pitaya_go_nrf52840.upload.uf2_board_id=PITAYAGO
pitaya_go_nrf52840.build.openocdscript=nrf52-cmsis-dap.cfg
pitaya_go_nrf52840.build.jlink_device=NRF52840_XXAA
pitaya_go_nrf52840.upload.maximum_size=798720
pitaya_go_nrf52840.upload.maximum_data_size=262144
pitaya_go_nrf52840.upload.ram_end=0x20040000
pitaya_go_nrf52840.upload.flash_end=0x00100000
pitaya_go_nrf52840.build.mcu=cortex-m4
pitaya_go_nrf52840.build.f_cpu=64000000L
pitaya_go_nrf52840.build.board=NRF52_PITAYA_GO
pitaya_go_nrf52840.build.core=arduino
pitaya_go_nrf52840.build.variant=pitaya_go_nrf52840
pitaya_go_nrf52840.build.ldscript=nrf52840.ld
pitaya_go_nrf52840.build.usb_product="Pitaya Go nRF52840"
pitaya_go_nrf52840.build.base_flags=-DARDUINO_NRF52_PITAYA_GO -DNRF_BOARD_HAS_NATIVE_USB=1 -DNRF_BOARD_HAS_BATTERY=1 -DNRF_BOARD_HAS_WIFI=1 -DNRF_BOARD_HAS_IMU=1 -DNRF_BOARD_HAS_NFC=0
pitaya_go_nrf52840.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=0
pitaya_go_nrf52840.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
pitaya_go_nrf52840.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
pitaya_go_nrf52840.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1 -DNRF_SYSTEM_BOOTLOADER_RESET_MODE=2
pitaya_go_nrf52840.build.bootloader_app_start=0x26000
pitaya_go_nrf52840.build.flash_flags=-DNRF_BOARD_HAS_QSPI=1 -DNRF_BOARD_FLASH_PROFILE=3 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
pitaya_go_nrf52840.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
pitaya_go_nrf52840.build.debug_flags=
pitaya_go_nrf52840.build.profile_flags=-DNRF_BUILD_PROFILE=0
pitaya_go_nrf52840.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1 -DNRF_SYSTEM_RUNTIME_USB_VID=0x2886 -DNRF_SYSTEM_RUNTIME_USB_PID=0xF00E
pitaya_go_nrf52840.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
pitaya_go_nrf52840.build.storage_reserved_bytes=16384
pitaya_go_nrf52840.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.upload_mode_flags} {build.bootloader_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags}
pitaya_go_nrf52840.menu.usbcdc.enabled=Enabled (Serial Monitor)
pitaya_go_nrf52840.menu.usbcdc.enabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
pitaya_go_nrf52840.menu.usbcdc.disabled=Disabled (no Serial Monitor)
pitaya_go_nrf52840.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
pitaya_go_nrf52840.menu.flashprofile.qspi=Internal 1 MB + QSPI (capacity unverified)
pitaya_go_nrf52840.menu.flashprofile.qspi.build.flash_flags=-DNRF_BOARD_HAS_QSPI=1 -DNRF_BOARD_FLASH_PROFILE=3 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
pitaya_go_nrf52840.menu.flashprofile.internal1m=Internal flash only (1 MB, clone-safe)
pitaya_go_nrf52840.menu.flashprofile.internal1m.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
pitaya_go_nrf52840.menu.ramprofile.sram256=Built-in RAM (256 KB)
pitaya_go_nrf52840.menu.ramprofile.sram256.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
pitaya_go_nrf52840.menu.uploadmode.usb=USB bootloader (DFU/UF2, recommended)
pitaya_go_nrf52840.menu.uploadmode.usb.upload.tool=niusdfu
pitaya_go_nrf52840.menu.uploadmode.usb.upload.tool.default=niusdfu
pitaya_go_nrf52840.menu.uploadmode.usb.upload.protocol=dfu
pitaya_go_nrf52840.menu.uploadmode.usb.upload.use_1200bps_touch=false
pitaya_go_nrf52840.menu.uploadmode.usb.upload.wait_for_upload_port=false
pitaya_go_nrf52840.menu.uploadmode.usb.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
pitaya_go_nrf52840.menu.uploadmode.uf2boot=Enter UF2 drive only (no upload)
pitaya_go_nrf52840.menu.uploadmode.uf2boot.upload.tool=niusdfu
pitaya_go_nrf52840.menu.uploadmode.uf2boot.upload.tool.default=niusdfu
pitaya_go_nrf52840.menu.uploadmode.uf2boot.upload.protocol=dfu
pitaya_go_nrf52840.menu.uploadmode.uf2boot.upload.use_1200bps_touch=false
pitaya_go_nrf52840.menu.uploadmode.uf2boot.upload.wait_for_upload_port=false
pitaya_go_nrf52840.menu.uploadmode.uf2boot.upload.enter_bootloader_only=true
pitaya_go_nrf52840.menu.uploadmode.uf2boot.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
pitaya_go_nrf52840.menu.uploadmode.swd=SWD programmer (CMSIS-DAP)
pitaya_go_nrf52840.menu.uploadmode.swd.upload.tool=niusopenocd
pitaya_go_nrf52840.menu.uploadmode.swd.upload.tool.default=niusopenocd
pitaya_go_nrf52840.menu.uploadmode.swd.upload.protocol=swd
pitaya_go_nrf52840.menu.uploadmode.swd.upload.use_1200bps_touch=false
pitaya_go_nrf52840.menu.uploadmode.swd.upload.wait_for_upload_port=false
pitaya_go_nrf52840.menu.uploadmode.swd.build.openocdscript=nrf52-cmsis-dap.cfg
pitaya_go_nrf52840.menu.uploadmode.swd.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
pitaya_go_nrf52840.menu.uploadmode.jlink=SWD programmer (SEGGER J-Link)
pitaya_go_nrf52840.menu.uploadmode.jlink.upload.tool=niusjlink
pitaya_go_nrf52840.menu.uploadmode.jlink.upload.tool.default=niusjlink
pitaya_go_nrf52840.menu.uploadmode.jlink.upload.protocol=swd
pitaya_go_nrf52840.menu.uploadmode.jlink.upload.use_1200bps_touch=false
pitaya_go_nrf52840.menu.uploadmode.jlink.upload.wait_for_upload_port=false
pitaya_go_nrf52840.menu.uploadmode.jlink.build.openocdscript=nrf52-jlink.cfg
pitaya_go_nrf52840.menu.uploadmode.jlink.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
pitaya_go_nrf52840.menu.uploadmode.jlink.debug.server=jlink
pitaya_go_nrf52840.menu.bootloader.auto=Auto-detect (recommended)
pitaya_go_nrf52840.menu.bootloader.auto.upload.bootloader_mode=auto
pitaya_go_nrf52840.menu.bootloader.auto.upload.usb_vid=auto
pitaya_go_nrf52840.menu.bootloader.auto.upload.usb_pid=auto
pitaya_go_nrf52840.menu.bootloader.auto.upload.uf2_family_id=
pitaya_go_nrf52840.menu.bootloader.auto.upload.uf2_app_start=0x26000
pitaya_go_nrf52840.menu.bootloader.auto.upload.uf2_volume_label=
pitaya_go_nrf52840.menu.bootloader.auto.upload.uf2_model=
pitaya_go_nrf52840.menu.bootloader.auto.upload.uf2_board_id=
pitaya_go_nrf52840.menu.bootloader.auto.upload.maximum_size=798720
pitaya_go_nrf52840.menu.bootloader.auto.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1 -DNRF_SYSTEM_BOOTLOADER_RESET_MODE=2
pitaya_go_nrf52840.menu.bootloader.auto.build.bootloader_app_start=0x26000
pitaya_go_nrf52840.menu.bootloader.nordicdfu=Nordic PCA10059 USB serial DFU (MBR, 0x1000)
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.bootloader_mode=nordic-dfu
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.usb_vid=0x1915
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.usb_pid=0x521F
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.uf2_family_id=
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.uf2_app_start=0x1000
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.adafruit_sd_req=0x00
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.uf2_volume_label=
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.uf2_model=
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.uf2_board_id=
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.maximum_size=897024
pitaya_go_nrf52840.menu.bootloader.nordicdfu.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
pitaya_go_nrf52840.menu.bootloader.nordicdfu.build.bootloader_app_start=0x1000
pitaya_go_nrf52840.menu.bootloader.nicenano=nice!nano v2 UF2 mass storage
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.bootloader_mode=uf2
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.usb_vid=0x239A
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.usb_pid=0x00B3
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.uf2_family_id=0xADA52840
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.uf2_app_start=0x26000
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.adafruit_sd_req=0x00B6
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.uf2_volume_label=NICENANO
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.uf2_model=nice!nano
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.uf2_board_id=nRF52840-nicenano
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.maximum_size=798720
pitaya_go_nrf52840.menu.bootloader.nicenano.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
pitaya_go_nrf52840.menu.bootloader.nicenano.build.bootloader_app_start=0x26000
pitaya_go_nrf52840.menu.bootloader.xiaouf2=Seeed XIAO UF2 mass storage
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.bootloader_mode=uf2
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.usb_vid=0x2886
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.usb_pid=0x0044
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.uf2_family_id=0xADA52840
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.uf2_app_start=0x27000
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.adafruit_sd_req=0x0123
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.uf2_volume_label=XIAO-BOOT
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.uf2_model=Seeed XIAO nRF52840
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.uf2_board_id=nRF52840-SeeedXiao-v1
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.maximum_size=794624
pitaya_go_nrf52840.menu.bootloader.xiaouf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
pitaya_go_nrf52840.menu.bootloader.xiaouf2.build.bootloader_app_start=0x27000
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2=MakerDiary nRF52840 M.2 UF2, SoftDevice S140 v6 layout (0x26000)
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.bootloader_mode=uf2
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.usb_vid=0x2886
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.usb_pid=0xF00F
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_family_id=0xADA52840
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_app_start=0x26000
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.adafruit_sd_req=0x00B6
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_volume_label=nRF52840M2
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_model=MakerDiary nRF52840 M.2 Module
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_board_id=nRF52840M2
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.maximum_size=798720
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_app_start=0x26000
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2=MakerDiary nRF52840 M.2 UF2, no SoftDevice / MBR only (0x1000)
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.upload.bootloader_mode=uf2
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.upload.usb_vid=0x2886
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.upload.usb_pid=0xF00F
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_family_id=0xADA52840
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_app_start=0x1000
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.upload.adafruit_sd_req=0xFFFE
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_volume_label=nRF52840M2
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_model=MakerDiary nRF52840 M.2 Module
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.upload.uf2_board_id=nRF52840M2
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.upload.maximum_size=950272
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
pitaya_go_nrf52840.menu.bootloader.makerdiarynosduf2.build.bootloader_app_start=0x1000
pitaya_go_nrf52840.menu.buildprofile.release=Release (smaller/faster, -Os)
pitaya_go_nrf52840.menu.buildprofile.release.compiler.optimization_flags=-Os
pitaya_go_nrf52840.menu.buildprofile.release.build.debug_flags=
pitaya_go_nrf52840.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
pitaya_go_nrf52840.menu.buildprofile.debug=Debug symbols (-Og -g3)
